<a href="https://colab.research.google.com/github/YAshRaj412/Assignment/blob/main/Pandas_1st(mini_assignment).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas First Exercises
Dear Students this notebook contains simple exercises for beginners to practice basic Pandas operations such as creating Series, DataFrames, saving files, and importing data.

### Exercise 1: Creating Pandas Series

1. Create a Pandas Series containing the marks of 5 students in Maths.
2. Create a Pandas Series that stores 5 city names.
3. Create a Pandas Series with 5 different floating-point numbers representing temperature readings.

In [ ]:
#answer here
import pandas as pd
S1 = pd.Series([1, 2, 3, 4, 5])
S2 = pd.Series(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami'])
S3 = pd.Series([25.5, 28.2, 26.8, 27.3, 29.0])

c = pd.concat([S1, S2, S3])
print(c)

0              1
1              2
2              3
3              4
4              5
0       New York
1    Los Angeles
2        Chicago
3        Houston
4          Miami
0           25.5
1           28.2
2           26.8
3           27.3
4           29.0
dtype: object

### Exercise 2: Creating DataFrames from Series

1. Create two Series: one containing student names and another containing their ages. Combine them into a single DataFrame.
2. Create three Series: 'Product Name', 'Price', and 'Quantity'. Combine them into one DataFrame and display it.

In [ ]:
#answer here
import pandas as pd
S1 = pd.Series(['Alice', 'Bob', 'Charlie', 'David', 'Eve'])
S2 = pd.Series([25, 30, 22, 28, 24])
df = pd.DataFrame({'Name': S1, 'Age': S2})
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    David   28
4      Eve   24

### Exercise 3: Creating DataFrames from Dictionaries

1. Create a dictionary with keys as 'Name', 'Age', and 'City', each containing a list of 3 values. Convert it into a DataFrame.
2. Create a dictionary with keys 'Product', 'Category', and 'Price'. Convert it into a DataFrame and print it.

In [ ]:
#answer here
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago

### Exercise 4: Saving DataFrames to CSV and Excel

1. Save any one of your created DataFrames into a CSV file named 'students.csv'.
2. Save another DataFrame into an Excel file named 'products.xlsx'.

In [ ]:
#answer here
import pandas as pd
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 22],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df = pd.DataFrame(data)
df.to_csv('students.csv', index=False)
df.to_excel('products.xlsx', index=False)

### Exercise 5: Reading Data from Files

1. Use Pandas to read the CSV file 'students.csv' that you created earlier.
2. Use Pandas to read the Excel file 'products.xlsx' that you created earlier.

In [ ]:
#answer here
import pandas as pd
df = pd.read_csv('students.csv')
print(df)
df = pd.read_excel('products.xlsx')
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago
      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   22      Chicago